; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v12 ?v7)
             (pred_4 ?v6 ?v3)
             (pred_1 ?v12 ?v3)
             (pred_2 ?v4 ?v12 )
	     (pred_10 ?v12)
             (pred_9 ?v1)
             (pred_7 ?v6)
             (pred_8 ?v3)
             (pred_3 ?v12)
             (pred_6 ?v6)
             (pred_5 ?v12)
             (pred_12 ))



(:action op_1
:parameters (?v11 ?v2 ?v5 ?v13)
:precondition (and (pred_9 ?v11) (pred_9 ?v2) (pred_7 ?v5) (pred_8 ?v13)
          (pred_11 ?v11 ?v2) (pred_4 ?v5 ?v13)
                   (pred_1 ?v2 ?v13) (pred_10 ?v11) 
                   (pred_3 ?v2) (pred_6 ?v5))
:effect (and  (pred_5 ?v2) (not (pred_3 ?v2))))


(:action op_3
:parameters (?v11 ?v9)
:precondition (and (pred_9 ?v11) (pred_9 ?v9)
               (pred_10 ?v11) (pred_11 ?v11 ?v9) (pred_5 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v11))))

(:action op_5
:parameters (?v11 ?v5)
:precondition (and (pred_9 ?v11) (pred_7 ?v5) 
                  (pred_10 ?v11) (pred_2 ?v5 ?v11) (pred_12 ))
:effect (and (pred_6 ?v5)
   (not (pred_2 ?v5 ?v11)) (not (pred_12 ))))


(:action op_4
:parameters (?v11 ?v8 ?v10)
:precondition (and (pred_9 ?v11) (pred_7 ?v8) (pred_7 ?v10)
                  (pred_10 ?v11) (pred_6 ?v10) (pred_2 ?v8 ?v11))
:effect (and (pred_6 ?v8) (pred_2 ?v10 ?v11)
        (not (pred_6 ?v10)) (not (pred_2 ?v8 ?v11))))

(:action op_2
:parameters (?v11 ?v5)
:precondition (and (pred_9 ?v11) (pred_7 ?v5) 
                  (pred_10 ?v11) (pred_6 ?v5))
:effect (and (pred_12 ) (pred_2 ?v5 ?v11) (not (pred_6 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_02 obj_04 obj_17 obj_01 obj_18 obj_13 obj_03 obj_15 obj_05 obj_22 obj_11 obj_12 obj_21 obj_19 obj_06
    obj_09 obj_14 obj_08
    obj_07 obj_20 obj_16
    )

    (:init
       (pred_12)

       (pred_9 obj_10)
       (pred_9 obj_02)
       (pred_9 obj_04)
       (pred_9 obj_17)
       (pred_9 obj_01)
       (pred_9 obj_18)
       (pred_9 obj_13)
       (pred_9 obj_03)
       (pred_9 obj_15)
       (pred_9 obj_05)
       (pred_9 obj_22)
       (pred_9 obj_11)
       (pred_9 obj_12)
       (pred_9 obj_21)
       (pred_9 obj_19)
       (pred_9 obj_06)
       (pred_8 obj_09)
       (pred_8 obj_14)
       (pred_8 obj_08)
       (pred_7 obj_07)
       (pred_7 obj_20)
       (pred_7 obj_16)

       (pred_11 obj_10 obj_01)
       (pred_11 obj_10 obj_02)
       (pred_11 obj_02 obj_18)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_02 obj_10)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_01 obj_15)
       (pred_11 obj_01 obj_18)
       (pred_11 obj_01 obj_10)
       (pred_11 obj_18 obj_05)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_02)
       (pred_11 obj_18 obj_01)
       (pred_11 obj_13 obj_22)
       (pred_11 obj_13 obj_03)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_03 obj_11)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_13)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_15 obj_01)
       (pred_11 obj_05 obj_21)
       (pred_11 obj_05 obj_22)
       (pred_11 obj_05 obj_18)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_11)
       (pred_11 obj_22 obj_13)
       (pred_11 obj_22 obj_05)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_11 obj_22)
       (pred_11 obj_12 obj_21)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_21 obj_19)
       (pred_11 obj_21 obj_05)
       (pred_11 obj_21 obj_12)
       (pred_11 obj_19 obj_06)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_21)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_19)
       (pred_3 obj_13)
       (pred_3 obj_05)
       (pred_3 obj_22)
       (pred_1  obj_13 obj_09)
       (pred_1  obj_05 obj_14)
       (pred_1  obj_22 obj_08)
       (pred_5 obj_10)
       (pred_5 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_17)
       (pred_5 obj_01)
       (pred_5 obj_18)
       (pred_5 obj_03)
       (pred_5 obj_15)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_21)
       (pred_5 obj_19)
       (pred_5 obj_06)

       (pred_4  obj_07 obj_09)
       (pred_4  obj_20 obj_14)
       (pred_4  obj_16 obj_08)
       (pred_2 obj_07 obj_02)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_16 obj_18)
       (pred_10 obj_02)
    )

    (:goal (and
       (pred_2 obj_16 obj_17)
    ))
(:constraints
  (always (not (pred_10 obj_04)))
)
)

; plan
1. (op_5 obj_02 obj_07)
   deleted: (pred_2 obj_07 obj_02) (pred_12)
   added: (pred_6 obj_07)
   goals met: 0 of 1
2. (op_3 obj_02 obj_18)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_18)
   goals met: 0 of 1
3. (op_1 obj_18 obj_13 obj_07 obj_09)
   deleted: (pred_3 obj_13)
   added: (pred_5 obj_13)
   goals met: 0 of 1
4. (op_4 obj_18 obj_16 obj_07)
   deleted: (pred_6 obj_07) (pred_2 obj_16 obj_18)
   added: (pred_6 obj_16) (pred_2 obj_07 obj_18)
   goals met: 0 of 1
5. (op_3 obj_18 obj_13)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_13)
   goals met: 0 of 1
6. (op_3 obj_13 obj_03)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_03)
   goals met: 0 of 1
7. (op_3 obj_03 obj_17)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_17)
   goals met: 0 of 1
8. (op_2 obj_17 obj_16)
   deleted: (pred_6 obj_16)
   added: (pred_12) (pred_2 obj_16 obj_17)
   goals met: 1 of 1
